# Расширение данных
### [Вернуться назад](https://github.com/Artexxx/Artem-python/blob/master/УЧЕБНИК/pandasTricks/README.md)

In [19]:
import pandas as pd
d = {"name":["John Artur Doe", "Jane Ann Smith"],
     "location":["Washington, DC", "Barcelona, SP"]}
pl = {"Team":   ["FC Barcelona", "FC Real Madrid"], 
    "Players": [["Ter Stegen", "Semedo", "Piqué", "Lenglet", "Alba", "Rakitic", "De Jong", "Sergi Roberto", "Messi", "Suárez", "Griezmann"], \
               ["Courtois", "Carvajal", "Varane", "Sergio Ramos", "Mendy", "Kroos", "Valverde", "Casemiro", "Isco", "Benzema", "Bale"]]}
fat = {"zip_code": [12345, 56789, 101112, 131415],"factory": [100, 400, 500, 600],"warehouse": [200, 300, 400, 500],"retail": [1, 2, 3, 4]}
df = pd.DataFrame(d)

## Превратить широкий df в длинный

In [24]:
df = pd.DataFrame(fat)
df[:2]

   zip_code  factory  warehouse  retail
0     12345      100        200       1
1     56789      400        300       2

In [28]:
# location_type is generated automatically from the columns left after specifying id_vars
# (you can pass a list also)
df.melt(id_vars = "zip_code", var_name = "location_type", value_name = "distance") \
.head()

   zip_code location_type  distance
0     12345       factory       100
1     56789       factory       400
2    101112       factory       500
3    131415       factory       600
4     12345     warehouse       200

# Сплит столбца
* если не получается то записывается не изменённое значение

In [10]:
df

             name        location
0  John Artur Doe  Washington, DC
1  Jane Ann Smith   Barcelona, SP

In [11]:
#                              split on first space  
df["first_name"] = df["name"].str.split(n = 1).str[0]
df["last_name"] = df["name"].str.split(n = 1).str[1]

df[["first", "middle", "last"]] = df["name"].str.split(" ", expand = True)

df["city"] = df["location"].str.split(",", expand = True)[0]
df

,name,location,first_name,last_name,first,middle,last,city
0,John Artur Doe,"Washington, DC",John,Artur Doe,John,Artur,Doe,Washington
1,Jane Ann Smith,"Barcelona, SP",Jane,Ann Smith,Jane,Ann,Smith,Barcelona

# Создать одну строку для каждого элемента в списке

In [25]:
df = pd.DataFrame(pl)
df

             Team                                            Players
0    FC Barcelona  [Ter Stegen, Semedo, Piqué, Lenglet, Alba, Rak...
1  FC Real Madrid  [Courtois, Carvajal, Varane, Sergio Ramos, Men...

In [31]:
df1 = df.explode("Players")
df1.head()

           Team     Players
0  FC Barcelona  Ter Stegen
0  FC Barcelona      Semedo
0  FC Barcelona       Piqué
0  FC Barcelona     Lenglet
0  FC Barcelona        Alba

# Разделить данные для обучения
 - `test_size` = 0.33 (Взять 33% данных)(по умолчанию 25%)
 - `statify`= набору данных по которому будет группировка, для рандома

In [37]:
from sklearn.model_selection import train_test_split
from sklearn.datasets import load_iris
X, y = load_iris(return_X_y=True)
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42, statify=y)